-- phpMyAdmin SQL Dump
-- version 5.1.3
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Nov 28, 2022 at 12:17 PM
-- Server version: 10.4.24-MariaDB
-- PHP Version: 8.1.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `edman_new`
--

-- --------------------------------------------------------

--
-- Table structure for table `permissions`
--

CREATE TABLE `permissions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `permissions`
--

INSERT INTO `permissions` (`id`, `name`, `created_at`, `updated_at`) VALUES
(1, 'عرض الرئيسية', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(2, 'عرض التقارير الذكية', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(3, 'عرض المشرفين', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(4, 'اضافة المشرفين', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(5, 'تعديل المشرفين ', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(6, 'حذف المشرفين', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(7, 'عرض المدن ', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(8, 'اضافة المدن', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(9, 'تعديل المدن', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(10, 'حذف المدن', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(11, 'عرض العملاء', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(12, 'اضافة عملاء', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(13, 'تعديل العملاء', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(14, 'حذف العملاء', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(15, 'عرض الفنين ', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(16, 'اضافة الفنين', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(17, 'تعديل الفنين', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(18, 'حذف الفنين', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(19, 'عرض الخدمات', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(20, 'اضافة خدمات', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(21, 'تعديل الخدمات', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(22, 'حذف الخدمات', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(23, 'عرض التقارير', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(24, 'عرض الاشعارات', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(25, 'اضافة الاشعارات', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(26, 'تعديل الاشعارات', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(27, 'حذف الاشعارات', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(28, 'عرض طلبات التواصل', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(29, 'حذف طلبات التواصل', NULL, NULL),
(30, 'عرض سجل عمليات النظام', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(31, 'عرض الطلبات ', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(32, 'اضافة طلب جديد', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(33, 'العمليات علي الطلبات', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(34, 'عرض الادوار', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(35, 'اضافة الادوار', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(36, 'تعديل الادوار', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(37, 'حذف الادوار', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(38, 'اعطاء صلاحيات للمشرفين ', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(39, 'تفعيل المشرفين', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(40, 'تفعيل الخدمات', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(41, 'تفعيل العملاء', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(42, 'تفعيل الفنين', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(43, 'عرض الباقات', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(44, 'اضافة الباقات', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(45, 'تعديل الباقات', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(46, 'حذف الباقات', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(47, 'تفعيل الباقات', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(48, 'عرض الاشتراكات ', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(49, 'اضافة الاشتراكات', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(50, 'تعديل الاشتراكات', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(51, 'حذف الاشتراكات', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(52, 'عرض الاعدادات ', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(53, 'تعديل الاعدادات', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(54, 'عرض الاسئلة الشائعة', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(55, 'اضافة اسئلة شائعة', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(56, 'تعديل الاسئلة الشائعة', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(57, 'حذف الاسئلة الشائعة', '2022-07-03 12:31:55', '2022-07-03 12:31:55'),
(58, 'عرض موقعي', '2022-05-21 07:00:39', '2022-05-21 07:00:39'),
(59, 'التعديل علي موقعي', '2022-07-03 12:31:55', '2022-07-03 12:31:55');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `permissions`
--
ALTER TABLE `permissions`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `permissions`
--
ALTER TABLE `permissions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=60;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
